[
	{
		"name": "Jack Ward",
		"image": "1_jack-ward",
		"page": "https://www.instagram.com/jack________ward/",
		"post": "https://www.instagram.com/p/CQvz42nnWPA",
		"description": "Plant Bass’d Radio:\n@jack________ward PRIDE mix!\n\nJack is Back! and just in time to kick off our radio series as Pride Month closes out.\n\nWe would all much prefer to be celebrating and dancing together at this time. This mix sums up that sound we wish to all be around in celebration.\n\nEnjoy some balls-to-the-walls slammers from the man himself.\n\nLink in bio and our story to listen 🌈 🌈 🌈\n\nGraphics: @eggboy_design "
	},
	{
		"name": "Colm Brandon (CABAL)",
		"image": "2_colm-brandon",
		"page": "https://www.instagram.com/cabal.ie",
		"post": "https://www.instagram.com/p/CVQXD5cD1ad",
		"description": "Plant Bass’d Radio: Colm Brandon (@cabal.ie)\n\nOur mix series returns with a special all-vinyl mix from Cabal co-founder and director, Colm Brandon!\n\nSince it’s formation in Limerick in 2017, @cabal.ie has established itself as one of the leading party series in Ireland and it is ready to set its eyes on a new scene post lockdown.\n\nThe Cabal brand has become synonymous in Irish music, fashion and art with its consistent loyalty to up and coming Irish talents and creatives. In their own words, ‘a large part of Cabal’s identity is embracing it’s inherently Irish roots, and promoting the Irish creative scene whether it be music, fashion or art’.\n\nTheir return to club land is greatly anticipated after their highly successful courtyard parties at the University of Limerick, and the sell out monthly shows and live streams in Galway and Limerick that they have maintained over the past few years gaining significant approval.\n\nActs they have showcased include @skreamizm, @rkitt4eva, @brame.hamo @sallycberlin, as well as hosting @boilerroomtv and their Bass & Percs tour.\n\nCabal is still very much in the morning of its enterprise but it’s growth in such a short space of time is inspiration for all in the industry with communal ideals.\n\nThe many exciting projects that were dashed during the pandemic will soon come to fruition again and we can’t wait to be apart of it with them!\n\nLink in bio and our story to listen to the mix with sounds from Moodymann, DeFekt, Leon Vynehall & more.\n\n@eggboy_design"
	},
	{
		"name": "Kyle (Lo Key Collective)",
		"image": "3_kyle",
		"page": "",
		"post": "",
		"description": "In the middle of writing"
	},
	{
		"name": "Saz",
		"image": "4_saz",
		"page": "",
		"post": "",
		"description": "In the middle of writing"
	}
]
